[
  [
    {
      "type": "artist",
      "title": "Captain Black + the Maiden",
      "artists": "",
      "artistRef": "black",
      "description": "Captain Black + the Maiden is a music project created by Alissa Brianna and Cedric Antonio in New York City. The duo strives to conjure multiple genres of  music as healing and conversation through the lived experiences they’ve shared. Alissa Brianna, born in Niagara Falls, NY, has an empathetic ear to Jazz, Neo Soul, Acoustic Rock along with a solid presence in Cabaret throughout New York State. Cedric Antonio, born in Baltimore, MD, has an empathetic ear to Folk, Dark Rock, Electro with a presence in Fashion and Gallery Curation in New York City. Both share a background in Gospel, and respectively, a flair for Theatrics.\n\nThe presentation at MIX will no doubt conjures the same. Captain Black + the Maiden will share a soundscape of music and themes that will be present in projects of this year for both artists. It will also culminate the festival and direct the energy of the collective going forward through another tumultuous, but rewarding year as artists."
    },
    {
      "type":"art",
      "title":"Pleasure Bubble Internet Café/Viral Illumination Meditation Room",
      "artists":"Vasilios Papapitsios",
      "artistRef":"papapitsios",
      "description": "A café for the sensual, seductive, and seroconverted souls. Guests at MIX will be happy to find this calm place where they can feel uplifted, bright, grounded and re-energized (if they leave at all!)\n\nInspired by Google’s balloon internet project “Loon” which floats WiFi around the world, this loon(ey) project is focused on intersectional wellness and combating stigma through soft mediums and joy.\n\nThis project amplifies the content from Going Viral 101 in a tangible and interactive experience that is a meditation on the pleasure/joy principle and intimacy rather than the strong rhetoric of pain and fear associated with HIV stigma (or any other stigma, for that matter.) It is a womb in which people may reflect, embrace and expand.\n\nInside this viral illumination pleasure portal, guests will discover 24/7 wifi, nap time, play time, cuddle time, meditation, serious (or silly!) conversation and more.\n\nJoin us on this journey to inner space."
    },
    {
      "type":"artist",
      "title":"Charlene Incarnate",
      "artists":"",
      "artistRef":"incarnate",
      "description": "Brooklyn’s sweetheart Charlene Incarnate began to explore her identity (and later her enacted gender transition) in performances on stages throughout the borough. She holds it down monthly for transfeminine queens at her shows Be Cute and Jizz, and practices ancestral gay magic at ritual drag shows hosted at her homes in Brooklyn and Tennessee. Charlene is the current reigning Miss Bushwig."
    },
    {
      "type":"art",
      "title":"Conversation Therapy",
      "artists":"Sage Yockelson",
      "artistRef":"yockelson",
      "description": "Conversation Therapy is a video loop replicating the dream you might have after falling asleep watching late-night TV. It is a series of affirmations to be repeated: combining found media (in particular, animated GIFs) and lines of original poetry, this installation both responds totransphobia within the queer community and reconciles trans identity with mental illness. The video loop is intended to be projected onto a wall or screen with a set of headphones so that the viewer might feel enveloped by both the video loop and the soundtrack."
    },
    {
      "type": "artist",
      "title": "C. Paige",
      "artists": "",
      "artistRef": "paige",
      "description": "C. Paige, (aka Christian Paige) hails from North Carolina & now resides in Bronx, NYC. At an very early age it was realized that he would be a star. Before, becoming the beautiful swan that you see now, Christian, was bullied and suffered at the hands off men who said they loved him. His music is the Ultimate Love Story, as it is all mostly personal & true life stories from his own love life, past and present. Since jumping into his music career full-time in 2014, Christian has made some triumphant strides & is now fully engulfed into his dream of entertainment. A chameleon of media, Christian not only sings, but he writes for many prominent artist, he’s also a producer, vocal arranger, vocal coach, background vocalist, plus models and just starting acting. His new project “Cracks in My Rainbow” comes out later this year, in July 2018."
    },
    {
      "type":"art",
      "title":"#(hashtag)",
      "artists":"Maris Salumets, Barbora Namerova",
      "artistRef":"salumets",
      "description": "The #MeToo phenomenon was one of the most important social and political moments of 2017. # aims to take a closer look to this movement’s success and also critique where it is lacking. While everybody can agree that such a campaign and conversation has been much needed and has a positive effect on society, has it given everybody an equal voice?\n\nThe main idea of the installation is to portrait subjective experience via double projection while using skin as the main motif. Our skin covers and protects us and also documents what we are experiencing in day to day life, making it one of the most transparent organs we have. If we could change skins between us, could we understand each other better?\n\nThe projections will be accompanied by constant flow of audio taken from actual news of #metoo coverage. This will show the noise we have been experiencing since October 2017 and the shifts in public opinion, creating even greater grey area between right and wrong.\n\nThe intention of the project is to open up the questions we all have in our minds in the new Post-Weinstein era, but are too afraid to ask. As important as #MeToo is, and as vital it is that we support it, we must take the discussion to the next level and explore the various perspectives and repercussions in as much depth as possible, so it will not fade into white noise in declining society. "
    },
    {
      "type":"artist",
      "title":"Tyler Matthew Oyer",
      "artists":"",
      "artistRef":"oyer",
      "description": "Calling All Divas is an episodic exploration of actual and imagined queer ancestries. A performative conflation of multiple personas presents the complex possibilities and limits of identifying, indexing, archiving, and fantasizing inherited and desired radical, queer intergenerational linkages on the body and mind.\n\nCalled an \"interdisciplinary gospel immortalist\" by Kembra Pfahler of the Voluptuous Horror of Karen Black, Tyler Matthew Oyer is an artist, writer, organizer, and educator based in Los Angeles. He has presented work at MoMA PS1, REDCAT, The Getty Museum, dOCUMENTA (13), Hammer Museum, Kunstnernes Hus Oslo, Art Basel Miami Beach, Bergen Kunstall, Rogaland Kunstsenter, The Royal Vauxhall Tavern, High Desert Test Sites, Highways Performance Space, Human Resources LA and the Orange County Museum of Art. He has written works of performance including Calling All Divas, GONE FOR GOLD, Shimmy Shake Earthquake, and 100 Years of Noise: Beyoncé is ready to receive you now. Oyer is represented by Cirrus Gallery and his work is in the permanent collection of the Museum of Modern Art (NY). Oyer is the founder of tir journal, an online platform for queer, feminist, and underrepresented voices. He received an MFA from the California Institute of the Arts in 2012."
    },
    {
      "type":"art",
      "title":"MONUMENTS",
      "artists":"Bizzy Barefoot",
      "artistRef":"barefoot",
      "description": "Since Judas sold Jesus for 30 gold coins, the number 30 has towered in the psyche of human experience as a symbol of things that may be considered nothing less than monumental. This year MIX NYC celebrates a monumental occasion, as this unlikely queer underdog of a film festival, lifting its head proudly, becomes 30. Helmed by a group of brand new hearts, minds, and faces, MIX marches into a truly monumental moment on a number of symbolic levels. In this spirit, Bizzy Barefoot, long time MIX venue staff, returning to her roots after a hiatus, presents a series of interactive, interdisciplinary “MONUMENTS” that remind us to reflect on what it means for MIX and its devotees to be standing in this hard-won place of cultural longevity and relevance.\n\nMONUMENTS is a collection of interactive multimedia sculptures meant to challenge the individualism usually inherent in memorial structures, lifting up whole movements rather than single individuals, including QTPoC figures that are continually erased from queer history and the great shifts of culture that come from them."
    },
    {
      "type": "artist",
      "title": "Church",
      "artists": "",
      "artistRef": "church",
      "description": "Church is a Brooklyn-based PROBLEM who makes Cuntemporary Gospel music. Looking, vers/bottom, can't host."
    },
    {
      "type":"artist",
      "title":"DJ William Francis",
      "artists":"",
      "artistRef":"francis",
      "description": "DJ and producer William Francis has been spinning tracks and turning out dance floors in New York's nightlife and underground scene for nearly 7 years. Inspired and influenced by NYC legends Nita Aviance, Danny Teneglia, Peter Rauhofer, Junior Vasquez and Michael Magnan, William serves old school house and tech no mixed with his own modern hip-hop and dance flair. From a young age William has been immersed in music as a guitar and piano player. His mother, the choir director at their family church, encouraged his love of music and instilled in him a deep understanding and passion for gospel music that translates to the energy he puts out on the dance floor. "
    }
  ]
]