[
  [
    {
      "type":"screening",
      "image":"OpeningNight",
      "title":"Opening Night",
      "purchaseUrl": "https://www.brownpapertickets.com/event/3369951",
      "description":"The selection of films featured in Opening Night are a hint at what's to come at MIX 30.\n\nThis showcase provides a glimpse into the many varied experiences and issues faced by our community in this day and age. Bringing to the forefront these slices of life sets the stage for further rumination on the state of our union as a community of people with so much in common, yet so much to teach each other.",
      "time":"3/29/2018 8:00 PM",
      "eventStart": "2018-03-30T00:00:00.000Z",
      "eventEnd": "2018-03-30T02:03:00.000Z",
      "duration":"143",
      "filmInfo":[
        {
          "name":"Protokolle / Protocols",
          "artist":"Jan Soldat",
          "filmDescription":"Three men talking about their longing of being slaughtered and eaten.",
          "filmDetails": "2017, Germany, video, color, sound, German w/ English subtitles, 20 min. US Premiere",
          "contact": "jan.soldat@yahoo.de"
        },
        {
          "name":"A ton age le Chagrin C'est Vite Passé (Your young years will dry your tears)",
          "artist":"Alexis Langlois",
          "filmDescription":"First heartache, Billie is devastated. The jokes of her girlfriends and the sweet words of her mother echo in her like old songs. Nothing to do, Billie is inconsolable.",
          "filmDetails": "2016, France, video, color, sound, French w/ English subtitles, 30 min. US Premiere",
          "contact": "festival@shortcuts.pro"
        },
        {
          "name":"Laisse tomber les filles",
          "artist":"claRa apaRicio-yoldi",
          "filmDescription":"Homage to Godard, Gallo and of course Eisenstein and his montage theory. By cutting and looping short segments of footage from both “dance scenes” of Vivre sa vie and Buffalo ’66 (where the directors break the logic and continuity rules of narrative cinema), I created a new meaning: a play of seduction and frivolous dance where individual dramas are hidden behind loops and repetitions. The video is inspired by Eisenstein’s theory of intellectual montage as an alternative system to continuity editing. New ideas emerge from the collision of the images, ideas that were not innate in any them. A new concept explodes into being. Instead of a woman dancing for a man like in both original films, each woman here dances for the other one. They are “seducing” each other, breaking with the stereotypes of cinema. The soundtrack is another appropriation and “looped” interpretation of the French song Laisse tomber les filles composed by Serge Gainsbourg.",
          "filmDetails": "2013, UK, video, color, sound, 2 min",
          "contact": "clara@aclararte.com"
        },
        {
          "name":"Pricked",
          "artist":"Adam Smith & Justin Batchelor",
          "filmDescription":"Adam and Lukas met online. Like, 20 minutes ago. They're horny. They go at it. But something goes wrong when one of them sets a rule and the other one thinks it's weird.",
          "filmDetails": "2017, UK, video, color, sound, 5 min. NY Premiere",
          "contact": "adam@adamesmith.co.uk"
        },
        {
          "name":"Music for Dead Animals #1",
          "artist":"Henry Wilde (aka Antonia Baehr), Neo Hülcker",
          "filmDescription":"Music for Dead Animals #1 In this two-on-one performance for video Wilde/Hülcker play an ASMR concert for a dead owl. This is the first of an improvisation series for video in which the genderqueer duo Wilde/Hülcker performs sounds into the ears of dead animals. Research about the specific acoustical life of each animal/posthumous listener informs the choice of instrumentation. The young composer performer Neo Hülcker (aka ASMR artist Thousand Tingles) and the middle-aged choreographer performer Henry Wilde (aka choreographer Antonia Baehr) have been working together extensively since 2016. They work in a variety of visual and acoustical formats including the fields of ASMR (autonoumous sensory meridian response) and ecosex.",
          "filmDetails": "2017, UK, video, color, sound, 5 min. NY Premiere",
          "contact": "g3.1990@gmail.com"
        },
        {
          "name":"Sisters of the Wicked Wig",
          "artist":"Adam Golub, Gayatri Kaul, Shane O'Neill	",
          "filmDescription":"Two experimental drag queens, whose love for one another is matched only by their ambition to be seen as dominant forces within the gritty drag culture of Brooklyn’s Bushwick neighborhood, create a drag festival in the summer of 2012. We follow them through two years of their life as they contend with challenges ranging from coming out to their families as drag queens to the sacrifices they must make to survive as fringe artists in a rapidly-gentrifying city. Featuring commentary from Warhol superstar Penny Arcade (star of 1968’s The Queen) and legendary drag queen Flawless Sabrina (star of 1968’s The Queen), a story of survival, creativity and family unfolds. Many of the characters in our documentary are key figures in the Brooklyn and NYC queer community and this documentary looks at the very process of how queer culture can generate the economic forces that lead to its own displacement. MIX NYC continues to be a space in which the queer community of New York City can come together to explore itself and its own identity through art and film and this key question of our role in the city is particularly pertinent today.",
          "filmDetails": "2015, USA, video, color, sound, 78 min.",
          "contact": "shane.oneill.edits@gmail.com"
        }
      ]
    },
    {
      "type": "screening",
      "image": "pearl",
      "title": "OPENING NIGHT PASS",
      "purchaseUrl": "https://www.brownpapertickets.com/event/3364520",
      "price": "$30"
    }
  ],

  [
    {
      "type":"screening",
      "image":"MirrorTellsAStory",
      "title":"The Mirror Tells A Story\nAnd It Looks A Lot Like Mine",
      "purchaseUrl": "https://www.brownpapertickets.com/event/3369999",
      "description":"Film can expose us to both new ideas and realities as well as hold up a mirror to our own. The Mirror Tells A Story And It Looks a Lot like Mine is a curated contemplation of issues rarely acknowledged due to the hegemonic oppression of the peoples that face them in legal and education systems.\n\nThese personal experiences, especially those of gender-variant folks, non-English speakers, and/or sex workers are erased by society. The queer and trans community is especially cognizant of these issues: these stories look like ours. Marginalized groups aren’t able to access economy in \"normal\" ways, so they often have to live on the fringe, never feeling prioritized or seen.",
      "time":"3/30/2018 7:00 PM",
      "eventStart": "2018-03-30T23:00:00.000Z",
      "eventEnd": "2018-03-31T00:30:00.000Z",
      "duration":"30",
      "filmInfo":[
        {
          "name":"Gabey & Mike",
          "artist":"Alexis Mitchell & Stephanie Markowitz",
          "filmDescription":"A Jewish Summer Camp Love Story takes its name from a song by Mermaid Café - a folk band comprised of Andi D., Joe A. Rider and Merrill Nisker (now known as ‘Peaches’) that gained popularity at Canadian Jewish summer camps in the early 90s. The video juxtaposes the tale of the band with playful re-creations of the story of Gabey and Mike, in a queer re-staging of the classic summer camp movie.",
          "filmDetails": "2016, Canada, video, color, sound, 21 min.",
          "contact": "bookings@cfmdc.org"
        },
        {
          "name":"Take a Walk on the Wildside",
          "artist":"Lisa Rideout",
          "filmDescription":"Opened in 1987, Wildside was one of the only places to offer a full male to female transformation through makeup, clothing and hair. Still open today, Take a Walk on the Wildside provides viewers with a glimpse into a day in the life of the store. As five customers pass through, we peek into their colorful lives and reasons for visiting, while storeowner Paddy consistently offers warm and welcoming service. In an age where items can be purchased easily and tutorials accessed online, Take a Walk on the Wildside shows why the store acts as safe and important space for its clientele.",
          "filmDetails": "2017, Canada, video, color, sound, 15 min.",
          "contact": "bookings@cfmdc.org"
        },
        {
          "name":"À Vancouver",
          "artist":"Vincent Chevalier",
          "filmDescription":"Blending documentary and fiction, the video examines and expands upon parallel events in the maker and his father’s lives, wherein they each traveled across Canada to Vancouver, and had formative (homo)sexual experiences at separate moments in time: the father as an 18-year-old traveling in the mid-60s and the maker as a young teen and then adult in the mid-90s and 2000s. À Vancouver stages these narratives in the genre of the father-son road trip exploring themes of queer temporality, memory, and linguistic, cultural, and sexual inheritance.",
          "filmDetails": "2016, Canada, video, color, sound, 35 min.",
          "contact": "info@vtape.org"
        },
        {
          "name":"mothertongue.m3u",
          "artist":"Rachika S & Biki Zoom",
          "filmDescription":"2017, USA, video, color, sound, 23 min.",
          "filmDetails": "",
          "contact": "rnsamarth@gmail.com"
        },
        {
          "name":"Lil’ Tokyo Story",
          "artist":"Matthew Lax",
          "filmDescription":"A shot-for-shot remake of the opening credits and the climax of Tokyo Story (Yasujiro Ozu, 1953), Part I uses the original Japanese text delivered orally, with subtitles literally translated into English. Part II repeats the scene, with the standard subtitles authored by the Criterion Collection and Donald Richie delivered orally, with subtitles literally translated back to Japanese.\n\nFlanked by abstracted pillow shots of Los Angeles, the roles of Noriko and Kyoko are played by two Japanese male immigrants in a subtle attempt at drag; queering the original situation while also further playing with translation through poetic distance.",
          "filmDetails": "2016, USA, 2-channel video, b&w, sound, 4 min.",
          "contact": "mattsamlax@gmail.com"
        },
        {
          "name":"Onward Lossless Follows",
          "artist":"Michael Robinson	",
          "filmDescription":"A password-protected love affair, a little vapor on Venus, and a horse with no name ride out in search of a better world. Against the mounting darkness, a willing abduction offers a stab at tomorrow.",
          "filmDetails": "2017, USA, video, color, sound, 17 min.",
          "contact": "michaelblayneyrobinson@hotmail.com"
        },
        {
          "name":"Efficient Story",
          "artist":"claRa apaRicio-yoldi",
          "filmDescription":"A camera slowly follows the figure of a woman walking, with continuous travelling. On both sides, in an impossible space, hang framed pictures with recognizable images from the history of Western painting, in which the great geniuses, men, have represented the figure of women over centuries. Towards the end of her journey she begins to be reflected in these paintings, which are now mirrors that return her image. Then she will pass through the painting. Will she now end up being the spectator, to take a position, and create her own representative modes?",
          "filmDetails": "2016, UK, video, color, sound, 4 min. US Premiere",
          "contact": "clara@aclararte.com"
        },
        {
          "name":"182 cm Queenie",
          "artist":"La JohnJoseph",
          "filmDescription":"Commissioned by HOME (Manchester) for La Movida, a group show which marked 30 years since the end of General Franco’s fascist regime in Spain. The end of Franco's rule meant the easing of censorship, and greater freedoms, explicitly for LGBTQ people and women. It is however a largely overlooked cultural moment, but one of significant impact if only for the artists who emerged from it. La JohnJoseph steps into the newly fabricated guise of anarcho-autocrat, 2D Joan and takes to the TV waves to formally announce Spain's transition from dictatorship to democracy.",
          "filmDetails": " 2017, UK, video, color, sound, English w/ English subtitles, 17 min. US Premiere",
          "contact": "bibby.johnjoseph@gmail.com"
        }
      ]
    },

    {
      "type": "screening",
      "image": "ReOrientations",
      "title": "RE:ORIENTATIONS",
      "purchaseUrl": "https://www.brownpapertickets.com/event/3370005",
      "description": "In 1984, Richard Fung released Orientations: Lesbian and Gay Asians, the first documentary to explore the experiences and perspectives of queer Asians in North America. Capturing pivotal moments in Toronto’s history, it presents an intimate portrait of the texture of gay lives and politics at that time. Re:Orientations revisits seven of the original participants as they see anew the footage of their younger selves, and reflect on their lives and all that has changed over the intervening three decades. Their interviews are deepened and contextualized by conversations with six younger queer and trans activists, scholars and artists.\n\n2016, Canada, video, color, sound, [closed caption available], 68 min.",
      "time": "3/30/2018 9:00 PM",
      "eventStart":"2018-03-31T01:00:00.000Z",
      "eventEnd": "2018-03-31T02:10:00.000Z",
      "duration": "68",
      "contact": "info@vtape.org",
      "filmInfo": []
    },

    {
      "type": "screening",
      "image": "CuratorsChoice",
      "title": "Curators' Choice",
      "purchaseUrl": "https://www.brownpapertickets.com/event/3370018",
      "description": "Much like our wonderful community that often serves as a safe haven for those who feel as though they don't belong anywhere else, these pieces are amazing 'square pegs' that we could not leave on the cutting room floor. This is a hand-picked showcase by our 2018 Programming Committee that celebrates the oddities of MIX 30.\n\nhe result is an eclectic curation of films that puts a spotlight on topics that, despite not quite applying to other MIX 30 showcases, are nonetheless illuminating.",
      "time": "3/30/2018 11:00 PM",
      "eventStart":"2018-03-31T03:00:00.000Z",
      "eventEnd": "2018-03-31T04:00:00.000Z",
      "duration": "42",
      "filmInfo": [
        {
          "name":"Onward Lossless Follows",
          "artist":"Michael Robinson	",
          "filmDescription":"A password-protected love affair, a little vapor on Venus, and a horse with no name ride out in search of a better world. Against the mounting darkness, a willing abduction offers a stab at tomorrow.",
          "filmDetails": "2017, USA, video, color, sound, 17 min.",
          "contact": ""
        },
        {
          "name":"Efficient Story",
          "artist":"claRa apaRicio-yoldi",
          "filmDescription":"A camera slowly follows the figure of a woman walking, with continuous travelling. On both sides, in an impossible space, hang framed pictures with recognizable images from the history of Western painting, in which the great geniuses, men, have represented the figure of women over centuries. Towards the end of her journey she begins to be reflected in these paintings, which are now mirrors that return her image. Then she will pass through the painting. Will she now end up being the spectator, to take a position, and create her own representative modes?",
          "filmDetails": "2016, UK, video, color, sound, 4 min. US Premiere",
          "contact": ""
        },
        {
          "name":"182 cm Queenie",
          "artist":"La JohnJoseph",
          "filmDescription":"Commissioned by HOME (Manchester) for La Movida, a group show which marked 30 years since the end of General Franco’s fascist regime in Spain. The end of Franco's rule meant the easing of censorship, and greater freedoms, explicitly for LGBTQ people and women. It is however a largely overlooked cultural moment, but one of significant impact if only for the artists who emerged from it. La JohnJoseph steps into the newly fabricated guise of anarcho-autocrat, 2D Joan and takes to the TV waves to formally announce Spain's transition from dictatorship to democracy.",
          "filmDetails": " 2017, UK, video, color, sound, English w/ English subtitles, 17 min. US Premiere",
          "contact": ""
        },
        {
          "name":"Lil’ Tokyo Story",
          "artist":"Matthew Lax",
          "filmDescription":"A shot-for-shot remake of the opening credits and the climax of Tokyo Story (Yasujiro Ozu, 1953), Part I uses the original Japanese text delivered orally, with subtitles literally translated into English. Part II repeats the scene, with the standard subtitles authored by the Criterion Collection and Donald Richie delivered orally, with subtitles literally translated back to Japanese.\n\nFlanked by abstracted pillow shots of Los Angeles, the roles of Noriko and Kyoko are played by two Japanese male immigrants in a subtle attempt at drag; queering the original situation while also further playing with translation through poetic distance.",
          "filmDetails": "2016, USA, 2-channel video, b&w, sound, 4 min.",
          "contact": ""
        }
      ]
    },

    {
      "type": "screening",
      "image": "DoubleFeatureHorrorComedy",
      "title": "Double Feature Horror/Comedy",
      "purchaseUrl": "https://www.brownpapertickets.com/event/3370176",
      "description": "Nothing could encapsulate the spirit of the queer experience better than the intersection of comedy and horror. Upon viewing this selection of films, viewers may not be able to tell which are which, and that may be the point--to demonstrate that experiences are often both.\n\nIn everything hilarious, there may be darkness, and frightening experiences are sometimes those at which we look back on after we've grown and chuckle at our own naiveté. Films that both tickle and terrify us can leave an odd taste in our mouths and an indistinguishable, perhaps conflicted, feeling in our gut. We're simultaneously drawn to and repelled by these stories.",
      "time": "3/31/2018 01:00 AM",
      "eventStart":"2018-03-31T05:00:00.000Z",
      "eventEnd": "2018-03-31T06:40:00.000Z",
      "duration": "100",
      "filmInfo": [
        {
          "name":"2 Spirit Dreamcatcher Dot Com",
          "artist":"Thirza Cuthand",
          "filmDescription":"2 Spirit Dreamcatcher Dot Com queers and indigenizes traditional dating site advertisements. Using a Butch NDN \'lavalife\" lady (performed by director Thirza Cuthand), 2 Spirit Dreamcatcher Dot Com seduces the viewer into 2 Spirit \"snagging and shacking up\" with suggestions of nearby pipeline protests to take your date to, and helpful elders who will matchmake you and tell off disrespectful suitors. It's the culturally appropriate website all single 2 Spirit people wish existed. A follow-up to 2 Spirit Introductory Special $19.99, this work examines the forces of capitalism through envisioning a \"financially unfeasible\" service for a small minority community.",
          "filmDetails": "2017, Canada, video, color, sound, 5 min. ",
          "contact": "info@vtape.org"
        },
        {
          "name":"PYOTR495",
          "artist":"Blake Mason",
          "filmDescription":"Opened in 1987, Wildside was one of the only places to offer a full male to female transformation through makeup, clothing and hair. Still open today, Take a Walk on the Wildside provides viewers with a glimpse into a day in the life of the store. As five customers pass through, we peek into their colorful lives and reasons for visiting, while storeowner Paddy consistently offers warm and welcoming service. In an age where items can be purchased easily and tutorials accessed online, Take a Walk on the Wildside shows why the store acts as safe and important space for its clientele.",
          "filmDetails": "2016, Canada, video, color, sound, 15 min.",
          "contact": "bookings@cfmdc.org"
        },
        {
          "name":"Cheeto Side of Heaven",
          "artist":"Ethan Shoshan",
          "filmDescription":"Cheeto Side of Heaven plays with the possibilities of desire poised by the current political atmosphere.  Set in the waterless future, this is the story of a girl as she turns to a bag of Cheetos to fulfill her and happens upon transcendence.",
          "filmDetails": "2017, USA, video, color, sound, 16 min. ",
          "contact": "disiterate@gmail.com"
        },
        {
          "name":"METANOIA,METANOIA",
          "artist":"Joshua Alexander Matteo",
          "filmDescription":"A young woman experiences strange, mysterious phenomena in New York City after discovering three chests in the woods. An Italian-style fantastique horror.  An entirely queer production with an entirely transgendered cast.  The film began as an allegory for finding your truth but soon evolved into a parable about death, crossing the other side of consciousness, a need of escape from the violent mad world, and the shattering of your ego to become new.  The film is a result of hours of esoteric research into ancient Gnosticism.  The Gnostics were most definitely the \"queers\" of their day.  Throughout history they were ostracized and massacred for their beliefs and willingness to call out the establishment. What began as a simple ode to Italian horror became a rich, esoteric, spiritual film.  The film is free of dialogue and is a dreamlike slow burn which beckons the viewer into a trancelike state. You can stream in 1080p HD or download a 10gb uncompressed copy. It is recommended to watch the film at night.",
          "filmDetails": "2017, USA, video, color, sound, 16 min.",
          "contact": "jamgp2009@icloud.com"
        },
        {
          "name":"Hookup",
          "artist":"Stan Madray, Christain Stella, Sameer Nurani, Elise Stella",
          "filmDescription":"Everything you want is right there in the palm of your hand. Simple, quick, easy. He’s just a text away.",
          "filmDetails": "2017, USA, video, color, sound, 10 min. US Premiere",
          "contact": "stanmadray1@gmail.com"
        },
        {
          "name":"1st DAY & NEXT MINUTE",
          "artist":"Sara Koppel",
          "filmDescription":"I am just sending you a shout out for my new shortfilm\"1st DAY & NEXT MINUTE\"\nAn explicit rush adventure\ninto a she-persons zone of desires\nWhere lust & responsibility\nis constantly dividing & demanding needs.\nTwo & a half minute new animated micro-short film.",
          "filmDetails": "2018, Denmark, video, color, sound, 3 min. US Premiere",
          "contact": "ulydigefjaes@gmail.com"
        },
        {
          "name":"Twirl Diary 21",
          "artist":"Roger Kingsepp",
          "filmDescription":"The Twirl Diary of Roger Kingsepp, entry dated November 15, 1994 With these lines, the Twirl Diary begins: a series of entries spanning primarily from November to February 1994/95, which chronicle the facts and feelings of the filmmaker’s sexual activities, or twirls, in gay male commercial sex establishments in Manhattan and Brooklyn. An intimate coming of age story from the time of plague, Twirl Diary 21 is a history untold of the psychological reckoning of homophobia, shame, and grief. In TWIRL DIARY 21, a 40-something filmmaker reads the sex, or “twirl,” diary of his 20-something self. He stands outside the former commercial sex establishments in Manhattan and Brooklyn where the activity occurred and reads the graphic entries for the camera. The sight of the 47-year-old filmmaker today reading words written when he was 26 reinforces for the viewers this sense of folded time. The footage incorporates reflections of the cityscape through storefront glass, holiday and car lights and sights and sounds of passing pedestrians and traffic; all contributing to the layering effect of the aural and visual, presence and absence, past and present. TWIRL DIARY 21 operates on the level of a memorial and the echoes of the past resonate within each frame. Today, we are at an inflection point where LGBT people can legally marry and barebacking is no longer a bad word. But the fundamental conflict between responsibility and pleasure remains for people of all sexual orientations, but especially for those at the margins. ",
          "filmDetails": "2017, USA, video, color, sound, 32 min.",
          "contact": "roger.kingsepp@gmail.com"
        }
      ]
    },
    {
      "type": "screening",
      "image": "pearl",
      "title": "FRIDAY NIGHT PASS",
      "purchaseUrl": "https://www.brownpapertickets.com/event/3369981",
      "price": "$30"
    }
  ],

    [
      {
        "type":"screening",
        "image":"SweetandSilverSalute",
        "title":"Sweet & Silver Salute",
        "purchaseUrl": "https://www.brownpapertickets.com/event/3370194",
        "description":"Intergenerational relationships within the queer community--both on an individual basis in a romantic, sexual or platonic capacities as well as between demographics at large--can be enlightening. But for many reasons, from ageism and youth worship to the AIDS crisis, these relationships can be fraught with misunderstanding. Sweet & Silver Salute is both an homage to our queer elders as well as a contemplation on the issues they faced, from both inside and outside perspectives.",
        "time":"3/31/2018 6:00 PM",
        "eventStart": "2018-03-31T22:00:00.000Z",
        "eventEnd": "2018-03-31T23:30:00.000Z",
        "duration":"90",
        "filmInfo":[]
      },
      {
      "type": "screening",
      "image": "OMGLOLWTF",
      "title": "OMG LOL WTF",
        "purchaseUrl": "https://www.brownpapertickets.com/event/3378210",
        "description": "OMG TECH!\n\nOMG GENDERQUEER PROTAGONIST BASELINE!\n\nKairos Dirt has technical prowess for days, from the richness of color, to the amazing audio mix and music supervision that is just as important as the visuals, to the care that went to placing it’s frenetic cultural signposts. Kairos Dirt is a film that centers around a non-binary youth, living in a non-patriarchal household that loves them. The norms that surround mainstream films--stories that end with the couple finally getting together, or the deviant eventually meeting an on-stage end--that’s not here.\n\nWTF LOGIC! It’s a great pleasure when a film approaches things so different that you don’t have a map to go by, but nonetheless there is an architecture, allowing you to ride along with it, and every minute becomes a surprise.\n\nLOL PERFORMANCE! The performances are raw and untrained in the best possible way, like they were cast because folks knew that Rosie is perfect for inflecting the right balance of feels in response to backhanded compliments.\n\n“I wanted to make a queer film that showed differently-sized, trans and gender-ambiguous bodies engaging beyond the politics of queerness.” -- Madsen Minax\n\nMadsen Minax makes interdisciplinary art projects about individual and communal embodiment and how we form relationships with other humans in the world. Projects investigate the relationship between intimacy and violence, the nature of chosen and biological families, transformation and power struggle. Madsen's projects use tactics of documentary, improvisation, essay and magical realist approaches, and draw on his history of participation in justice oriented communities.\n\nMadsen is currently a Claire Rosen and Samuel Edes Foundation fellow as well as a Queer | Arts | Mentorship fellow. He lives between Brooklyn, NY and Burlington, VT.",
      "time": "3/30/2018 8:00 PM",
      "eventStart":"2018-03-31T00:00:00.000Z",
      "eventEnd": "2018-03-31T01:30:00.000Z",
      "duration": "90",
      "filmInfo": [
        {
        "name":"Kairos Dirt & the Errant Vacuum",
        "artist":"Madsen Minax",
        "filmDescription":"Kairos Dirt & the Errant Vacuum follows the strange happenings of two middle school lunch ladies, a genderqueer student, a lesbian hospice provider, a grieving ministry worker, a mystical mortician and an astrologer/phone sex operator.\n\nA series of collective dreams follows a trans-worldly being invading the consciousness of each character, ultimately revealing an alternate realm of latent, subconscious desires.\n\nSet amid the post-industrial decay of the American south, interconnected relationships form unusual and fantastic landscapes as television monitors, radio frequencies, orifices and dreams all become portals through which both characters and MIX guests may access this alternate dimension of carnality and longing.\n\nKairos Dirt & the Errant Vacuum is a film that is both profound and whimsical, coherent and absurd, and may provoke a reaction along the lines of “OMG LOL WTF!”",
        "filmDetails": "2017, USA, video, color, sound, 90 min.",
          "contact": "madsenwashere@gmail.com"
      }
      ]
      },

      {
        "type": "screening",
        "image": "BlackandBrownLivesMatter",
        "purchaseUrl": "https://www.brownpapertickets.com/event/3370242",
        "title": "We Agree: Black and Brown Lives Matter",
        "description": "In the world’s ever-tumultuous sociopolitical climate, it's never been more important to affirm that yes, BROWN AND BLACK LIVES MATTER!\n\nTo this end, MIX 30 strives to elevate the narratives of artists of color and their crucial stories. MIX 30 holds at its center space for these stories of migration, assimilation and asylum, geopolitics and gentrification, desire, disappointment and dis/identifications.",
        "time": "3/31/2018 10:00 PM",
        "eventStart": "2018-04-01T02:00:00.000Z",
        "eventEnd": "2018-04-01T03:00:00.000Z",
        "duration": "90",
        "filmInfo": [
          {
            "name": "“The world is round so that nobody can hide in the corners – Part I: Refuge",
            "artist": "Leandro Goddinho",
            "filmDescription": "13min documentary short film about the journey of a gay African refugee seeking asylum in Germany.\n\nIntegrate\n\nv. [ˈˈin-tə-ˌgrāt]\n\n1. combine (one thing) with another to form a whole.\n\n2. bring into equal participation in a social group or institution.\n\n\nRefuge\n\nn. [ˈref.juːdʒ]\n\n(a place that gives) protection or shelter from danger, trouble, unhappiness.",
            "filmDetails": "2017, Country, video, color, sound, 10 min",
            "contact": "leandrogoddinho@gmail.com"
          },
          {
            "name": "This Night, Who is Gonna Cry for You",
            "artist": "Dolissa Medina",
            "filmDescription": "",
            "filmDetails": "\"This Night, Who is Gonna Cry For You\" is a tribute to San Francisco's now-closed Esta Noche nightclub, the last Latino Gay Bar in the city.\n\n As hyper-gentrification takes over San Francisco's Mission District -- where Esta Noche operated for more than 30 years -- this video asks \"who will be left to cry\" for a neighborhood no longer recognizable by many. Appropriating a song from Swedish singer September, who in turn sampled from Bronski Beat's 1980s gay anthem \"Smalltown Boy,\" the video was compiled from cell phone footage uploaded to youtube by patrons of the bar. It also collages other digital ephemera found online, such as club flyers, with excerpts of a graphic novel by Bay Area artist Jaime Cortez.\n\nForgotten on youtube for several years, the 2014 video never broke 150 views.  In 2017, queer curator Susie Smith discovered the video online and screened the work as part of a day-long event exploring Queer Space Making, held at the SF Urban Film Festival.\n\nThis film will be of interest to MIX audiences on multiple levels - as documentation of a lost queer world, as a critique of economic displacement, and as a celebration of drag queens, go-go boys, trans women, jotos, cholos, vaqueros, doÃ±as, putas, and all the brown folks who share besos peligrosos. ",
            "contact": "dolissamedina@gmail.com"
          },
          {
            "name": "100 Boyfriends Mixtape",
            "artist": "Brontez Purnell",
            "filmDescription": "Veteran Bay Area performer and artists, Brontez Purnell makes his directorial debut with this semi-autobiographical \"video mix tape\", which was filmed on digital video, VHS and 8 MM film. Relying on his punk rock aesthetic to give the world a peek into his singularly unique perspective, \"100 Boyfriends\" takes the viewer on an unforgettable ride that's as audacious and hardcore as it is experimental.",
            "filmDetails": "4 min",
            "contact": "Brontez1@gmail.com"
          },
          {
            "name": "Two Snakes",
            "artist": "Kristin Li",
            "filmDescription": "2015, Canada, video, color, sound, 10 min. US Premiere",
            "filmDetails": "An experimental animation and documentary about diasporic desires for foundational myths. Seeking a home in reclaimed ancestry and seeking a self in reappropriated narratives and finding fragments instead. Features an original score by Julie Matson.",
            "contact": "giv@videotron.ca"
          },
          {
            "name": "SatisfiedGone",
            "artist": "Kengné TEGUIA",
            "filmDescription": "My name is Kengné TEGUIA, 30 years old, I'm considered myself as a queer artist because I am gay, also deaf, also HIV positive and also black.\n\nThe process of my work with the medium of video leads me to the experimentation because of my identity. Indeed, the main connection between theses videos is the sound, more specifically the music. For example, Erotica Romance is a cover of Erotica from Madonna, SatisfiedGone, a cover of \"Pour que tu m\'aimes encore\" from Celine DION.\n\nAs a deaf person and when I was a child, listening to music wasn't something that I could afford to, at the first place. I had to \"learn\" to understand the music to not consider it as some noise and to enjoy it. To make it that possible, I have to have/read the lyrics of the song I was listening to but at this time, we were at the beginning of the Internets, so the lyrics were, mostly only, on the albums of the artists. That makes me developed a privilege relationship with theses songs, the video-clip related to theses songs, the identity of the album, etc...\n\nThe fact that most of the songs that I know, and I covered, are part of the collective memory  is a way, I guess, to give some point of reference to the spectator to be open-minded to what I want to express in my abstract art.\n\nPlus, thanks to my parents, I had the incredible opportunity, as a deaf child, to have access to the films, to cinema in all its diversity, thanks to the suscription to the only channel, where all the films were subtitled, at this time. That made me a cinema-lover.\n\nI have the possibilities to hear thanks to my cochlear implants (bionic ears) and to be deaf without wearing theses devices.\n\nThe fact that if I choose video as one of my tools to express myself is not unfamiliar with the fact that I am obsessed by the possibilities of language that this medium can afford and most important, the understanding of hearing is really difficult without the sense of sight because of my disability.",
            "filmDetails": "3 min",
            "contact": ""
          },
          {
            "name": "black enuf*",
            "artist": "Carrie Hawks",
            "filmDescription": "A queer oddball seeks approval from black peers despite a serious lack of hip-hop credentials. This short animated documentary takes you on a quest for belonging.",
            "filmDetails": "2016, USA, video, color, sound, 22 min.",
            "contact": ""
          },
          {
            "name": "Home, a Queer Cooking Series: Untitled Queen",
            "artist": "Michael Chernak",
            "filmDescription": "Home is a queer cooking series. Home is inclusive. Home is about real people and real food. Itâ€™s about coming together, taking care of each other and sharing our stories. It seeks to create loving, human and honest images of queer people through something we all do each day. Food brings people together, it's personal and creates intimacy.\n\nMatthew is a visual artist and graphic designer living in Bed Stuy, Brooklyn. In this episode Matthew makes Flourless Peanut Butter Cookies and talks about their work as an artist and how even at the gig food plays a big part",
            "filmDetails": "2017, USA, video, color, sound, 4 min.",
            "contact": "homequeercooking@gmail.com"
          },
          {
            "name": "The world is round . . . part 2",
            "artist": "Leandro Goddinho",
            "filmDescription": "Experimental documentary where a gay African refugee visits the Gay Holocaust Memorial in Berlin.",
            "filmDetails": "2017, Country, video, color, sound, 4 min.",
            "contact": "leandrogoddinho@gmail.com"
          }
        ]
      },

      {
        "type": "screening",
        "image": "NSFW",
        "title": "NSFW",
        "purchaseUrl": "https://www.brownpapertickets.com/event/3370260",
        "description": "A celebration of sexual desire that goes beyond identity to convey both kinky and commonplace experiences of intimacy. NSFW is a multifaceted meditation on sex--from gay porn aesthetics and the solitary home porn viewer to delightfully blasphemous and raunchy retellings of religious stories. Stigmata play? Check. A vagina smoking a cigarette? You know it. Enjoy your trip.",
        "time": "3/31/2018 1:00 AM",
        "eventStart": "2018-03-31T05:00:00.000Z",
        "eventEnd": "2018-03-31T06:30:00.000Z",
        "duration": "90",
        "filmInfo": [
          {
            "name": "The Doubting of St Thomas",
            "artist": "Yonadav Greenwood",
            "filmDescription": "",
            "filmDetails": "2016, USA, video, color, sound, 7 min., World Premiere",
            "contact": "yonadavbg@gmail.com"
          },
          {
            "name": "FlyHole",
            "artist": "Malic Amalya",
            "filmDescription": "In this dual projection slide show of collaged imagery, \"FlyHole\" tells the story of a housefly who transitions into a man in order to cruise gay bars. Text and images are appropriated from the March 1985 issue of the adult, gay digest magazine, Manscape, including illustrations by Mike Kuchar. ",
            "filmDetails": "2017, USA, video, color, sound, 9 min.",
            "contact": "malicamalya@gmail.com"
          },
          {
            "name": "Helium",
            "artist": "Daniel McIntyre",
            "filmDescription": "Commissioned by the 8 Fest for its 10 year anniversary, Helium is a dual-projector work that explores the worlds of competitive bodybuilding and balloon fetish. Originating from a deep fascination of the ability to derive such intense pleasure from otherwise innocuous objects or activities, Helium observes inflation, lust, and explosion.",
            "filmDetails": "2017, Canada, video, color, sound, 4 min.",
            "contact": "bookings@cfmdc.org"
          },
          {
            "name": "Latifundium",
            "artist": "Érica Sarmet",
            "filmDescription": "In Brazil, latifundios are large agricultural properties belonging to a single person, a family or company, characterized by the extensive exploitation of its resources. We are taught that our bodies are our first private property, a demarcated area that, as such, should be regulated and supervised by the State. But what if we start to think the body as a vast land with many possibilities of construction and creation outside the practices of monoculture sexuality? What if we invaded the body? Took it for ourselves? \"Latifundium\" is an experimental queer porn film, in the context of Latin America, on expanding our notions of the body, its desires and what can it do.\n\nSynopsis: \"The body is not merely matter but a continual and incessant materializing of possibilities\". ",
            "filmDetails": "2017, Brazil, video, color, sound, Portuguese w/ English subtitles, 12 min., US Premiere",
            "contact": "e.sarmet@gmail.com"
          },
          {
            "name": "DiAna's Hair Ego REMIX",
            "artist": "Ellen Spiro and Cheryl Dunye",
            "filmDescription": "30 years after Ellen Spiro made “DiAna’s Hair Ego: AIDS Info Up Front,” the AIDS crisis is still raging in the deep south where the film was shot.  Director Cheryl Dunye, after reading about the new AIDS crisis in the South, visits DiAna and Bambi in the hair salon where they first began their innovative safe sex education work.\n\nDiAna’s Hair Ego REMIX is the beginning of a new story and new hope in the face of an ongoing tragedy.",
            "filmDetails": "2017, USA, video, color, sound, 9 min.",
            "contact": ""
          },
          {
            "name": "Johnny R. Demented",
            "artist": "Fred Morin",
            "filmDescription": "\"When I look in the mirror, I'm like, 'damn, you look good!'\"\n]\nThis is a portrait of the \"gay4pay\" actor Johnny Rapid who participated in almost 200 scenes since 2011. Nearly 1200 images of his face were assembled in a large digital collage in order to make that video.Johnny R Demented or when money becomes the ultimate excuse to live one's sexuality by taking advantage of gay fantasies.",
            "filmDetails": "3 min. World Premiere",
            "contact": "fredmorin@free.fr"
          },
          {
            "name": "DICKHOLE",
            "artist": "Nathan Hill",
            "filmDescription": "An erotic, solitary journey through a perverse mind. A meditation on vintage gay porn, the medium of VHS, and the home video revolution.",
            "filmDetails": "8 min. World Premiere",
            "contact": "nhill60608@gmail.com"
          },
          {
            "name": "Guitar Idol",
            "artist": "Kolmel W. Love",
            "filmDescription": "Video game fantasies spring to life in this short animation that encourages you to rock out with your cock out!\n\nOn how it fits at MIX NYC:\n\nThis is truly the queerest perviest short I've ever made and because of that I hope it finds a home at MIX. I think it will delight the hearts and pants of many an audience member. thanks for considering.",
            "filmDetails": "2016, USA, 4 min., NY Premiere",
            "contact": "jkolmel@gmail.com"
          },
          {
            "name": "Furniture Porn Project",
            "artist": "Antoine Heraly",
            "filmDescription": "+++the hottest Louis Philippe wardrobes in a 10km radius around yours ‰ÛÓ this kinky little bed side table ready for a one-night-stand ‰ÛÓ central_island_unit sent you a private message+++\n\nally marry and barebacking is no longer a bad word. But the fundamental conflict between responsibility and pleasure remains for people of all sexual orientations, but especially for those at the margins.",
            "filmDetails": "2017, Germany, video, color, sound, 11 min., US Premiere",
            "contact": "heraly.antoine@gmail.com"
          }
        ]
      },
      {
        "type": "screening",
        "image": "pearl",
        "title": "SATURDAY NIGHT PASS",
        "purchaseUrl": "https://www.brownpapertickets.com/event/3369987",
        "price": "$30"
      }
      ],

    [
      {
        "type": "screening",
        "image": "HereAndNow",
        "title": "Here and Now: Meditations on the Contemporary State OF HIV/AIDS",
        "purchaseUrl": "https://www.brownpapertickets.com/event/3378210",
        "description": "In the late 1980s and early 1990s, thousands of AIDS Activist Videos were made by scores of grassroots videomakers, but with the diminution of direct political AIDS activism and the advent of protease inhibitors, the production of video decreased as well.  The political, social and medical conditions around HIV/AIDS have changed dramatically and desperately need a new generation of moving imagemakers to explore the ramifications of these changes.  Here are 8 examples of recent explorations of HIV/AIDS in hopes that this will inspire many more videos.  – Jim Hubbard, curator",
        "time": "4/01/2018 7:00 PM",
        "eventStart": "2018-04-01T23:00:00.000Z",
        "eventEnd": "2018-04-02T00:30:00.000Z",
        "duration": "81",
        "filmInfo": [
          {
            "name": "DiAna's Hair Ego REMIX",
            "artist": "Ellen Spiro and Cheryl Dunye",
            "filmDescription": "30 years after Ellen Spiro made “DiAna’s Hair Ego: AIDS Info Up Front,” the AIDS crisis is still raging in the deep south where the film was shot.  Director Cheryl Dunye, after reading about the new AIDS crisis in the South, visits DiAna and Bambi in the hair salon where they first began their innovative safe sex education work.\n\nDiAna’s Hair Ego REMIX is the beginning of a new story and new hope in the face of an ongoing tragedy.",
            "filmDetails": "2017, USA, video, color, sound, 9 min.",
            "contact": ""
          },
          {
            "name": "Stones & Water Weight",
            "artist": "Mykki Blanco",
            "filmDescription": "The video stems from a technique of how to deal with anxiety and stress: metaphorically picking up the heaviest object that you can hold, so all of your attention and focal points turn to the object, as a way to alleviate mental discomfort. I wanted to queer that idea, and apply it to an act of endurance. It’s a show, a ceremony, as a reaction to people's preconceived ideas of what the physical limits are of someone who is HIV+.\n\nPeople throw a lot of their own projections onto me about being HIV+ and how that now defines every single aspect of my narrative. When people know that you're HIV+, it comes with this question or gut reaction that you're somehow ill or incapable. I shot STONES & WATER WEIGHT with my boyfriend in a quarry in Norway, where I was on an artist residency. You're watching struggle and tension build in my body, and it relates to Greek mythology, Sisyphus and Atlas. Sisyphus is always rolling the stone up to the top of the hill to have it come back, and then has to roll the stone again. Atlas is a figure that holds the world in place on his shoulders, if he ever let go, the world would fly out of orbit. I very much know what it's like to feel like you have all this great success happening, while also spinning out of axis at the same time.\n\nI didn't want my narrative as an artist to stop with my HIV admission. I didn't have examples of anyone coming out as HIV+ and that being beneficial to their career, their practice, or their public image. The only examples that I ever had of anyone coming out as HIV+ were Magic Johnson and Eazy-E, which, generationally, I have never quite been able to connect with. I'm HIV+ in 2017. I don't need to be nostalgic or play into society's nostalgia about my condition. By sheer definition of living how I live, making the decisions that I make in my career as an artist, I'm going to redefine what you think that condition is in general, for me and for other people. I think that for a lot of people becoming HIV+ is the worst thing that's ever happened to them. But the buck doesn't just stop at me becoming or coming out as HIV+, fading away. I still have other ideas. I still have a platform. I'm going to keep working. And I have.",
            "filmDetails": "2017, USA, video, color, sound, 7 min",
            "contact": ""
          },
          {
            "name": "Going Viral",
            "artist": "Vasilios Papapitsios",
            "filmDescription": "An introductory course in \"Going Viral\" First installment in a 3-part series called Going Viral // Viral Illumination Going Viral // Viral Illumination explores the nature of stigma and transmissions within the various networks of our reality: between bodies, over psychic waves and through WiFi. The link between the internet (WiFi connections), spirituality (psychic waves), and physical exchange between bodies- spoken and unspoken- to bridge the gap between current millennial generations and the origins of HIV/AIDS consciousness to create a new paradigm or healing with digital art. All of this work has been channeled through my personal journey dealing with the stigma I face as an HIV-positive individual who survived serious AIDS and healing myself and others by holding new space away from the toxic concepts that surround it, perpetuate ignorance, and hinder healthy change in a rapidly viral world of media and networks we are now entirely plugged into. Transmuting fear into love and alchemizing the current zeitgeist of stigma for a new generation which is entrenched in a history not easily reimagined.",
            "filmDetails": "2017, USA, video, color, sound, 8 min",
            "contact": "vasiliospapapitsios@gmail.com"
          },
          {
            "name": "SOL",
            "artist": "Xena Ellison & Elizabeth Mputu",
            "filmDescription": "Loss L O S S S O L Sol - Sun GoodMourning Good Rising GRIEVING RITUALS 4 BLACK, TRANS, HIV+ BODIES LIVING UNDER SURVEILLENCE & PARANOIA IN 21ST CENTURY AMERIKKKA",
            "filmDetails": "2016, USA, video, color & B/W, 10 min.",
            "contact": "xena@xenaxellison.com"
          },
          {
            "name": "Hookup",
            "artist": "Stan Madray, Christain Stella, Sameer Nurani, Elise Stella",
            "filmDescription": "Everything you want is right there in the palm of your hand. Simple, quick, easy. He’s just a text away.",
            "filmDetails": "2017, USA, video, color, sound, 10 min. US Premiere",
            "contact": "stanmadray1@gmail.com"
          },
          {
            "name": "The Positive YouTubers",
            "artist": "Leandro Goddinho",
            "filmDescription": "(Portuguese with English Subtitles)\n\nAn experimental documentary made with footage material recorded from the computer desktop screen, about 4 Brazilians who have created YouTube Channels to talk openly about their HIV status, in a very positive way.\n\n\"Since the 1980's HIV is a strong stigma within the LGBTQ community affecting mostly gay men. In a Digital era, four Brazilian HIV positive created YouTube channels to talk openly about their status, in a very positive way. They are digital activists trying to spread a new message about how it is to live with the virus showing to their followers that HIV is no longer a death sentence. Sharing their daily lives they have created a sense of community online where people feel safe to interact, learn, exchange their knowledge, worries, and doubts about the subject matter that is still a taboo.”",
            "filmDetails": "2017, Brazil/Germany, video, color, sound, 15 min",
            "contact": "leandrogoddinho@gmail.com"
          },
          {
            "name": "PrEP in the Ballroom Scene",
            "artist": "Luna Luis Ortiz",
            "filmDescription": "Discussion on HIV, Pre-exposure Prophylaxis (‪#PrEP) and the House and Ball Community.",
            "filmDetails": "2013, video, color, sound, 4 min.",
            "contact": ""
          },
          {
            "name": "Red Red Red",
            "artist": "David Oscar Harvey",
            "filmDescription": "Red Red Red is an essay film that focuses on HIV criminalization in the state of Iowa. Both a personal and political film, Red Red Red considers big questions about the contemporary state of queer politics and the dimensions of identity for HIV-positive persons.",
            "filmDetails": "2011, USA, video, color, sound, 24 min.",
            "contact": "david.harvey@gmail.com"
          }
        ]
      },

      {
        "type": "screening",
        "image": "DesignOfTheDecades",
        "title": "DESIGN OF THE DECADES",
        "purchaseUrl": "https://www.brownpapertickets.com/event/3378222",
        "description": "The Design of the Decades showcase presents a stellar group of three mini-showcases by three different curators who have been involved with MIX over the past three decades.\n\nSarah Schulman, who co-founded MIX in 1987 with Jim Hubbard, is a novelist, playwright, screenwriter, nonfiction writer, and AIDS historian. She is the author of 18 books, most recently The Cosmopolitans, which Publishers Weekly chose as one of the best American novels of 2016, and Conflict is Not Abuse, winner of the Publishing Triangle Nonfiction Prize. Sarah is currently collaborating with Icon Marianne Faithful on The Snow Queen, a stage play featuring 24 songs from Marianne's career. Sarah is on the advisory board of Jewish Voice for Peace, and Claudia Rankine's Racial Imaginary Institute. She is faculty advisor to Students for Justice in Palestine at the College of Staten Island where she a Distinguished Professor. With Matt Brim and Linda Villarosa, she is co-founder of the HIV/AIDS Studies Institute at the City University of New York.\n\nIn 2007, Rajendra Roy joined The Museum of Modern Art as The Celeste Bartos Chief Curator of Film, a role in which he leads the Museum’s year-round initiatives to exhibit and preserve works from its collection of about 27,000 titles. In collaboration with colleagues at MoMA and partner institutions, he has organized exhibitions including Pedro Almodovar (2016), Bruce LaBruce (2015), Wim Wenders (2015), The Berlin School: Films from the Berliner Schule (2013), Tim Burton (2011), and Mike Nichols (2009). For the Museum’s imprint, Mr. Roy authored (with Anke Leweke) The Berlin School: Films from the Berliner Schule (2013).\n\nStephen Winter is an award-winning filmmaker and artist whose new show Adventures in New America, an afro-futuristic sci-fi radio satire series, premieres Spring 2018 on the Night Vale Network. His 2015 feature film Jason and Shirley was called “one of the year’s finest” by Richard Brody in The New Yorker. His award-winning 1996 debut film Chocolate Babies premiered at the Berlin Film Festival and enjoyed a 2016 revival at New York's Anthology Film Archives and at the Los Angeles Hammer Museum in 2018. In 2004, Stephen was co-director of MIX NYC experimental queer film festival and produced Jonathan Caouette’s landmark “narci-cinema” feature documentary Tarnation (A.O. Scott, New York Times) which premiered at Sundance, Cannes, LAIFF and NYFF. He has worked creatively with Lee Daniels on The Butler, The Paperboy and Precious, John Cameron Mitchell (Hedwig & The Angry Inch) and David France (The Death & Life Of Marsha P. Johnson and How To Survive A Plague).",
        "time": "4/01/2018 8:00 PM",
        "eventStart": "2018-04-02T00:00:00.000Z",
        "eventEnd": "2018-04-02T01:30:00.000Z",
        "duration": "90",
        "filmInfo": [
          {
            "name": "Mayhem",
            "artist": "Abagail Child",
            "filmDescription": "With Diane Torr, Ela Troyano, Plauto, Elion Sacker, Rex West. Additional sound: Christian Marclay, Charles Noyes, Zeena Parkins, Shelley Hirsch. Photographed by Child, Jeff Preiss (second camera). Characters from PERILS reappear, this time in a film noir setting, soap opera thrillers and Mexican comic books generating the action. Perversely and equally inspired by de Sade's Justine and Vertov's sentences about the satiric detective advertisement, MAYHEM is my attempt to create a film in which Sound is the Character and to do so focusing on sexuality and the erotic. Not so much to undo the entrapment (we fear what we desire; we desire what we fear), but to frame fate, show up the rotation, upset the common, and incline our contradictions toward satisfaction, albeit conscious.",
            "filmDetails": "1987, USA, 16mm, b&w, sound, 17 min.",
            "contact": "achild@mindspring.com"
          },
          {
            "name": "Two Marches",
            "artist": "Jim Hubbard",
            "filmDescription": "\"In [Jim Hubbard's] latest work, scenes shot at two national gay marches on Washington, DC are juxtaposed to reveal some of the devastating changes in the gay movement from 1979 to 1987, as hope is replaced by frustration and mourning. \"In Hubbard's roving footage we follow the shifts in spirit, age and racial composition of the demonstrators and witness the growing organization of the protest spectacle, as ragtag bunches of rebellious marchers give way to marching bands and the unfurling of the Names Project AIDS Quilt. ... Yet his touch is always gentle, and deeply, if elusively, personal, from the opening shots of Hubbard embracing the late filmmaker Roger Jacoby to the beautifully choreographed hands of deaf people signing. Always working within a small scale and tightly focused format, Hubbard has developed an astonishingly varied and emotionally complex body of work over the years, a series of personal film essays of intertwined loss and liberation.\" – Liz Kotz, Afterimage",
            "filmDetails": "1991, USA, 16mm, color, sound, 8 min.",
            "contact": "jimhubbardnyc@gmail.com"
          },
          {
            "name": "The Male Gayze",
            "artist": "Jack Waters",
            "filmDescription": "The 1989 video short (11 minutes) presents an individual's observation of sexuality and power relations between men, a young African American dancer's reminiscence of his encounter with a famous Dutch choreographer. The story is told in a casually direct voice-over that is read by the author/director. Issues of authority clash in a pedagogical combat zone. The depiction of seemingly random home movie-esque visuals cause the structures of text (masculine) and image (feminine) to form a contrapuntal relationship of identities. Waters constructs a theater where Black/White, European/American, Younger/Older; Experience and Beauty interact. Platonic in the original sense, the movie invites the viewer to engage in the process of experience itself, where one must make one's own reactive decisions. Like gender role playing itself, some viewers determine the postulation of form and content in The Male GaYze as competitive. Others sense the image/text relationship as complementary whereby the descriptive narrative can be absorbed unimpeded by undue intellectualization.",
            "filmDetails": "1990, USA, 16mm, b&w, sound, 11 min.",
            "contact": "jakeye0@gmail.com"
          },
          {
            "name": "First Comes Love",
            "artist": "Su Friedrich",
            "filmDescription": "First Comes Love consists of perfectly choreographed scenes of four wedding ceremonies accompanied by a complex medley of popular love songs. All seems to be going as it should until the couples reach the altar, when the celebratory atmosphere is interrupted for a surprising public service announcement. Then song and dance continues until the happy couples depart, leaving behind a dwindling crowd and a few altar boys who carefully sweep up the rice that blankets the pavement like snow.",
            "filmDetails": "1991, USA, 16mm, b&w, sound, 22 min.",
            "contact": "sufried@princeton.edu"
          },
          {
            "name": "Identities",
            "artist": "Nino Rodriguez",
            "filmDescription": "IDENTITIES attempts to describe the importance of silence in communication, of those moments when someone is making up or remembering what he is going to say. A silence that compels us to question the maxim \"silence is death\". IDENTITIES is someone's memory of someone else.",
            "filmDetails": "1991, USA, video, color, sound, 7 min.",
            "contact": "nino@pobox.com"
          },
          {
            "name": "Song from an Angel",
            "artist": "David Weissman",
            "filmDescription": "Rodney Price, of the legendary San Francisco theater troupe The Angels of Light, gave this incredible performance two weeks prior to his death from AIDS in 1988.",
            "filmDetails": "1988, USA, video, color, sound, 4 min.",
            "contact": "david@grandelusion.com"
          },
          {
            "name": "Tantalizing Ditty (Hindustan)",
            "artist": "Gita Reddy & David Kalal",
            "filmDescription": "Discussion on HIV, Pre-exposure Prophylaxis (‪#PrEP) and the House and Ball Community.",
            "filmDetails": "2013, video, color, sound, 4 min.",
            "contact": ""
          },
          {
            "name": "Shroom Trip Opera",
            "artist": "Liam Lynch",
            "filmDescription": "Artist and performer Joseph Keckler's operatic aria about his shroom trip gone wrong is now an animated video by Liam Lynch!",
            "filmDetails": "2013, USA, video, color, sound, 7 mins.",
            "contact": ""
          },
          {
            "name": "Bad At Dancing",
            "artist": "Joana Arnow",
            "filmDescription": "A perpetual third wheel and awkward outsider, Joanna increasingly inserts herself into the relationship of her more charismatic roommate Isabel. The two women test each other's sexual and emotional boundaries in this surreal manifestation of jealous rivalry.",
            "filmDetails": "2016, USA, video, color, B & W, sound, 11 mins. ",
            "contact": ""
          },
          {
            "name": "Memory Tracks",
            "artist": "Jamika Ajalon",
            "filmDescription": "A woman on the verge of a nervous breakdown follows the afroed spirit of a revolutionary past through London's streets: Brixton and Portobello. I used the camera as the means for reflexive analysis of black female subjectivity and performances of resistance in urban spaces, specifically within the context of London's Portobello and Brixton.",
            "filmDetails": "1996, UK, video, color, sound, 12 mins.",
            "contact": ""
          },
          {
            "name": "Salivation Army",
            "artist": "Scott Treleaven",
            "filmDescription": "This Is the Salivation Army was a 'queer pagan punk' zine, produced by artist Scott Treleaven from 1996-1999. The film tracks the rise and demise of Treleaven's publication and the strange cult it spawned: \"Blurrily combining evocative enactments of cult-like activities with genuine evidence from the project’s epoch, the film lyrically represents The Salivation Army as a brief movement in history—both inspirationally realized and pointedly imaginary. As Treleaven explained in the film’s voiceover, the best thing for The Salivation Army was not to be unique, but to be part of an ongoing history. These historical inspirations are unmistakable—from the cult musician/performer Genesis Breyer P-Orridge and writers William Burroughs and Brion Gysin to the most evocative influence: late-radical-queer-punk filmmaker Derek Jarman.\" -- Matt Wolf ('Wild Combination', 'Teenage')",
            "filmDetails": "2002, USA, video, B & W, sound, 22 mins.",
            "contact": ""
          },
          {
            "name": "Love Comix",
            "artist": "Barry Shills",
            "filmDescription": "",
            "filmDetails": "1982, USA, video, color, sound, 10 mins",
            "contact": "barryshils@gmail.com"
          }
        ]
      },
      {
        "type": "screening",
        "image": "pearl",
        "title": "SUNDAY NIGHT PASS",
        "purchaseUrl": "https://www.brownpapertickets.com/event/3369991",
        "price": "$30"
      }
      ]
  ]
